Revit 2027 API
BuiltInFailures.StairRampFailures.BalusterUpsideDown Property
 Top reference is below Bottom reference for one or more Balusters. These Balusters are not created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BalusterUpsideDown { get; }
Public Shared ReadOnly Property BalusterUpsideDown As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BalusterUpsideDown {
	FailureDefinitionId^ get ();
}
static member BalusterUpsideDown : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace